[
    {
        "id": 0,
        "Event": "GSoC Demo Day",
        "Start": "2023-08-24T11:00:00.000Z",
        "End": "2023-08-24T11:20:00.000Z",
        "Title": "Welcome to Rocket.Chat GSOC Demo Day 2023!",
        "Mentor": "",
        "Description": "Let's welcome all participants, contributors and Mentor!",
        "Speaker": "Sing Li & Felipe Scuciatto",
        "Duration": 5,
        "Youtube": null
    },
    {
        "id": "1",
        "Event": "GSoC Demo Day",
        "Start": "2024-08-10T16:00:00Z",
        "End": "2024-08-10T17:00:00Z",
        "Mentor": "Douglas, Devanshu, Sing Li",
        "Title": "AI Newsletter Generator and Publisher",
        "Speaker": "Yuriko Kikuchi",
        "Duration": 15,
        "Youtube": null,
        "Description": "This Rocket.Chat app leverages modern open source LLMs (Mistral, Llama2, Phi, and so on) to help generate newsletters for special interest groups and/or teams operating on a Rocket.Chat server. The newsletter author should be able to supply raw content to the AI generator and have perfectly phrased and formatted newsletter generated. The app should allow for the immediate or scheduled publication of the resulting newsletter to either a team, subset of the server's user, or all of the server's users. The app should also allow for emailing those who prefers to receive the newsletter via email. Ideally the app should maintain a list of dynamically changing newsletter subscribers."
    },
    {
        "id": "2",
        "Event": "GSoC Demo Day",
        "Start": "2024-08-11T03:00:00Z",
        "End": "2024-08-11T04:00:00Z",
        "Mentor": "Sing Li, Shubham Bhardwaj, John Crisp",
        "Title": "Extended LLM Prompt Editor/Explorer",
        "Duration": 15,
        "Youtube": null,
        "Speaker": "Ashutosh Singh",
        "Description": "The project aims to develop a comprehensive prompt editor within Rocket.Chat, facilitating seamless interaction between users and open source language models (LLMs) such as Mistral, Llama 2, and Phi. Key objectives include enabling free-flowing conversations, robust conversation history management, and seamless prompt sharing across external applications. The initial focus will be on implementing this functionality within the Rocket.Chat Web App and Electron platform."
    },
    {
        "id": "3",
        "Event": "GSoC Demo Day",
        "Speaker": "Anjaneya Gupta",
        "Start": "2024-08-11T01:00:00Z",
        "End": "2024-08-11T02:00:00Z",
        "Mentor": "M.PalaniKannan, Sing Li",
        "Title": "GSoC Community Hub 2024",
        "Duration": 15,
        "Youtube": null,
        "Description": "The Ultimate Solution for Scalable Static Websites Full-Stack Functionality: Seamlessly integrate data from the serverless CMS when needed, or choose alternative data sources according to your project requirements. Enhanced Syntax - Tailored for an effortless experience for community creators."
    },
    {
        "id": "4",
        "Event": "GSoC Demo Day",
        "Start": "2024-08-11T03:00:00Z",
        "End": "2024-08-11T04:00:00Z",
        "Mentor": "Sing Li, Shubham Bhardwaj",
        "Title": "AI Emoji Embellisher",
        "Duration": 15,
        "Speaker": "Sandeep Pillai",
        "Youtube": null,
        "Description": "Text embellishment is a natural language generation problem that aims to enhance the lexical and syntactic complexity of a text while retaining the same semantic information and meaning. This is often achieved by incorporating emojis, punctuation, and additional details to make the text more interesting and engaging. This proposal delves into the implementation details of the Embellisher App for Rocket.Chat. This app will enable users to generate emojified / embellished text messages from plain text messages they enter in the message box using open-source LLMs. Upon generation, the user will be notified with an interactive message that only the sender can see."
    },
    {
        "id": 5,
        "Event": "GSoC Demo Day",
        "Start": "2023-08-24T12:20:00.000Z",
        "End": "2023-08-24T12:40:00.000Z",
        "Mentor": "",
        "Title": "15 minutes Break",
        "Description": "",
        "Duration": 15,
        "Youtube": null
    },
    {
        "id": "6",
        "Event": "GSoC Demo Day",
        "Speaker": "Abhi Patel",
        "Start": "2024-08-10T23:00:00Z",
        "End": "2024-08-11T00:00:00Z",
        "Mentor": "Dhruv Jain, Rodrigo Nascimento",
        "Title": "Multiple file sharing in one message",
        "Duration": 15,
        "Youtube": null,
        "Description": "My project enhances file sharing functionality by allowing users to send multiple files in a single message, a significant improvement over the previous limitation of sharing only one file at a time. Users can easily add files they may have forgotten to include, and they can also remove files that were mistakenly selected."
    },
    {
        "id": "7",
        "Event": "GSoC Demo Day",
        "Speaker": "Akshun Kuthiala",
        "Start": "2024-08-10T20:00:00Z",
        "End": "2024-08-10T21:00:00Z",
        "Mentor": "Guilherme Gazzo, Diego Sampaio, Rodrigo Nascimento",
        "Title": "API Documentation Generator",
        "Duration": 15,
        "Youtube": null,
        "Description": "API documentation plays a vital role in developers’ workflow, serving as an essential reference for software integration and development. However, challenges such as outdated or inconsistent documentation frequently hinder efficient utilization. To address this, the proposed project aims to implement automation for API documentation generation leveraging a suite of tools including API Extractor, Typescript, Swagger and OpenAPI specifications. This initiative seeks to streamline the documentation process, ensuring accuracy, consistency, and timeliness in API references, thus enhancing overall development productivity and efficacy."
    },
    {
        "id": "8",
        "Event": "GSoC Demo Day",
        "Speaker": "Aman Negi",
        "Start": "2024-08-10T11:00:00Z",
        "End": "2024-08-10T12:30:00Z",
        "Mentor": "Nabhag Motivaras",
        "Title": "AI in-channel GIF Image Generator",
        "Duration": 90,
        "Youtube": null,
        "Description": "Imagine expressing yourself with GIFs that perfectly capture your ideas and emotions, all within the familiar Rocket.Chat interface. This innovative app takes GIF creation beyond simply searching for existing ones. It empowers you to generate entirely new GIFs based on your descriptive prompts! Here's what makes this app truly stand out: - Prompt-based Generation: Simply describe what you want the GIF to show, and the app uses an open-source text-to-GIF model to bring your vision to life! You can even easily integrate your own model for even more customization. - Seamless Workflow: Generated GIFs are readily available for use anywhere within Rocket.Chat. No need to switch applications or upload files – it's all integrated into your chat flow. - Don't Settle for the First Try: Not quite happy with the generated GIF? Simply regenerate it with a click for a better match to your needs. - Enhanced with NLP: Can't think of a perfect prompt? Use the prompt generation feature which uses LLM as NLP, leading to even better GIF generation results. - Profanity Filter: Maintain a professional environment with the NSFW content filtering feature, ensuring appropriate content creation. - Extensive History Management: This app goes beyond just storing the last ten creations which is standard for most RC Apps. Pagination allows you to view and access a much larger history of generated GIFs. This app, with its level of customization, built-in NLP features, and user-friendly design, becomes a powerful tool for anyone who wants to express themselves visually within their Rocket.Chat chats. It injects a whole new level of creativity and fun into your communication, making it a truly valuable addition to the platform."
    },
    {
        "id": "9",
        "Event": "GSoC Demo Day",
        "Speaker": "Hardik Bhatia",
        "Start": "2024-08-11T00:00:00Z",
        "End": "2024-08-11T01:00:00Z",
        "Mentor": "Gabriel Casals, Felipe Scuciatto",
        "Title": "AgileBot",
        "Duration": 15,
        "Youtube": null,
        "Description": "This project aims to enhance team productivity within agile environments by using a chatbot-based approach. By developing a chatbot that is customized to meet the needs of agile workflows, teams will be able to streamline communication, task management, and meeting coordination. This project will be implemented via the apps engine in Rocket.chat."
    },
    {
        "id": 10,
        "Event": "GSoC Demo Day",
        "Start": "2023-08-24T12:20:00.000Z",
        "End": "2023-08-24T12:40:00.000Z",
        "Mentor": "",
        "Title": "15 minutes Break",
        "Description": "",
        "Duration": 15,
        "Youtube": null
    },
    {
        "id": "11",
        "Event": "GSoC Demo Day",
        "Speaker": "Hunter Xia",
        "Start": "2024-08-10T22:00:00Z",
        "End": "2024-08-10T23:00:00Z",
        "Mentor": "Shiqi Mei",
        "Title": "AI Query Bot",
        "Duration": 15,
        "Youtube": null,
        "Description": "The AI Query Bot project is a cutting-edge Rocket.Chat application designed to revolutionize information retrieval by leveraging a highly configurable Retrieval Augmented Generation (RAG) pipeline. This pipeline integrates advanced natural language processing (NLP) technologies to deliver precise and contextually relevant answers to user queries. Users can customize various components, including embedding/tokenizer engines, vector database search algorithms, re-ranking strategies, and the choice of open-source Large Language Models (LLMs) like Mistral, Llama, and Phi. This flexibility ensures the bot can be tailored to meet specific needs and domains effectively."
    },
    {
        "id": "12",
        "Event": "GSoC Demo Day",
        "Speaker": "Jeffrey Yu",
        "Start": "2024-08-10T15:00:00Z",
        "End": "2024-08-10T16:00:00Z",
        "Mentor": "Devanshu Sharma, Sing Li",
        "Title": "Rocket.Chat AI Chat Summarizer",
        "Duration": 15,
        "Youtube": null,
        "Description": "This project aims to deliver a Rocket.Chat App that uses generative AI to summarize any conversations across threads, channels, and DMs. For example, a user can say, 'summarize my unread messages yesterday in the #engineering channel'. The users can ask AI any questions regarding the messages, and subscribe to personal digests that summarize selected channels on a recurring schedule. The AI summarizer will boost the productivity of Rocket.Chat users with faster information digest, and improve community engagement by keeping everyone on the same page."
    },
    {
        "id": "13",
        "Event": "GSoC Demo Day",
        "Speaker": "Maria Khelli",
        "Start": "2024-08-10T19:00:00Z",
        "End": "2024-08-10T20:00:00Z",
        "Mentor": "Sing Li, Douglas Gubert, Devanshu Sharma",
        "Title": "Smart Scheduling App Assistant",
        "Duration": 15,
        "Youtube": null,
        "Description": "Setting a calendar event is a small, but important process in our day-to-day job. It can take some of your time when you want to set up another meeting if you 1) Already have a tight schedule; 2) Your coworkers are in different time zones; and 3) Have to switch back and forth between the calendar and the messaging app. Hence, this project aims to streamline the process using a scheduling assistant, that can create meetings or set up a reminder using a prompt. The solution will involve a lot of large language models (LLM) experiments for the user prompt. Therefore, this project can act as a semi-research in which the result of LLM experiments can be used to approach similar cases."
    },
    {
        "id": "14",
        "Event": "GSoC Demo Day",
        "Speaker": "Prisha Gupta",
        "Start": "2024-08-11T02:00:00Z",
        "End": "2024-08-11T03:00:00Z",
        "Mentor": "Vinayak Sharma",
        "Title": "Ai assistant for rocket chat main repository",
        "Duration": 15,
        "Youtube": null,
        "Description": "An Al-Assistant is developed to help developers understand the Rocket.Chat codebase better. This tool uses the existing knowledge base of the code to answer questions about the code structure and logic. It can answer specific questions about the code, create diagrams to explain things clearer, find relevant documentation, and even suggest ways to improve the code. This will help new developers learn the code faster and make the codebase overall better quality, easier to maintain, and more consistent."
    },
    {
        "id": "15",
        "Event": "GSoC Demo Day",
        "Speaker": "Ryan Zhou",
        "Start": "2024-08-10T09:00:00Z",
        "End": "2024-08-10T10:00:00Z",
        "Mentor": "Samad, John, Mustafa",
        "Title": "AI Programmer",
        "Duration": 15,
        "Youtube": null,
        "Description": "This is an AI bot to help you automatically generate code pieces. A Rocket.Chat app that enables the AI programmer functionalities where users can utilize the tool to create a short piece of code in C/C++, Java, Javascript, Typescript or Python based on specification supplied by the user. This implementation includes modern open source LLMs (Mistral, CodeLlama, WizardCode, Llama2, Phi, and so on) for a simplified configuration. This functionality also allows users to ask for a new variation of the code or augment/fine-tune the system for a more precise code generation. To achieve this, we propose to design a more intuitive and interactive UX to simplify users’ interaction. Finally, we will explore to bridge the generated codes with sharing APIs, allowing them to be shared to external applications and added to GitHub as a pull request. The AI Programmer app will be published on Rocket.Chat Marketplace together with specified documentation."
    },
    {
        "id": 16,
        "Event": "GSoC Demo Day",
        "Start": "2023-08-24T12:20:00.000Z",
        "End": "2023-08-24T12:40:00.000Z",
        "Mentor": "",
        "Title": "15 minutes Break",
        "Description": "",
        "Duration": 15,
        "Youtube": null
    },
    {
        "id": "17",
        "Event": "GSoC Demo Day",
        "Speaker": "Umang Utkarsh",
        "Start": "2024-08-10T18:00:00Z",
        "End": "2024-08-10T19:00:00Z",
        "Mentor": "Abhinav Kumar",
        "Title": "News Aggregation App",
        "Duration": 15,
        "Youtube": null,
        "Description": "The News Aggregation Rocket.Chat App is designed to deliver the latest news from various sources directly within the Rocket.Chat platform. This project aims to create an application that aggregates news from top websites like TechCrunch and BBC News, utilizing APIs or RSS feeds to collect data. The app will present news in a user-friendly format with complete configurability of sources and categories, ensuring users can customize their news feed according to their preferences. The project will implement logic to collect news, categorize it, and present it effectively within the platform. By enhancing the Rocket.Chat ecosystem, this app aims to offer users a seamless way to stay updated with curated news content without leaving the chat environment."
    },
    {
        "id": "18",
        "Event": "GSoC Demo Day",
        "Speaker": "Vipin Chaudhary",
        "Start": "2024-08-10T13:00:00Z",
        "End": "2024-08-10T14:00:00Z",
        "Mentor": "Hugo Costa, Gabriel Casals",
        "Title": "Quick Replies",
        "Duration": 15,
        "Youtube": null,
        "Description": "Quick replies offers a convenient way to send standard responses swiftly, that can work as a pre-written message. Users can effortlessly create, edit, delete, and save a list of these quick replies, leveraging AI to generate responses tailored to their needs."
    },
    {
        "id": "19",
        "Event": "GSoC Demo Day",
        "Start": "2024-08-10T21:00:00Z",
        "End": "2024-08-10T22:00:00Z",
        "Mentor": "Sidharth Mohanty",
        "Speaker": "Zishan Ahmad",
        "Title": "EmbeddedChat",
        "Duration": 15,
        "Youtube": null,
        "Description": "EmbeddedChat integrates a full-featured chat interface into your app, connected to the Rocket.Chat server, offering easy setup and cool features, including: 1. Flexible Configuration: Adjust the chat window’s size, appearance, and functionality. 2. Extensible Design: Customize the chat’s look with theming options to match your app’s branding. 3. Robust Authentication: Supports various login methods and secure cookie options for auto-login. 4. Real-Time Layout Editing: The ‘layout-editor’ tool allows users to design and customize EmbeddedChat layouts in real-time using drag-and-drop functionality. It also generates a theme object for easy setup."
    },
    {
        "id": "20",
        "Event": "GSoC Demo Day",
        "Speaker": "Sayan Banerjee",
        "Start": "2024-08-10T17:00:00Z",
        "End": "2024-08-10T18:00:00Z",
        "Mentor": "Aditya Singh",
        "Title": "Graphical Guided RC Code Tours",
        "Duration": 15,
        "Youtube": null,
        "Description": "This project aims to smoothen out the on-boarding process of new contributors to Rocket.Chat. The huge size of Rocket.chat's codebase makes it a overwhelming task to understand and start contributing to it. We use the power of VsCode and its extension CodeTour to explain the most crucial parts of the codebase, motivating them to work towards Open-Source community. We also have circumvented one of the limitations of the Codetour extension, which is its incompatibility with ever-evolving codebases, by employing innovative methods."
    }
]