[
  {
    "id": 1,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T11:00:00.000Z",
    "End": "2023-08-24T11:20:00.000Z",
    "Title": "Welcome to Rocket.Chat GSOC Demo Day 2023!",
    "Mentor": "",
    "Description": "Let's welcome all participants, contributors and Mentor!",
    "Speaker": "Gabriel Engel & Rodrigo Nascimento",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 2,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T11:20:00.000Z",
    "End": "2023-08-24T11:40:00.000Z",
    "Title": "Scaled Botpress Connector",
    "Mentor": "Duda Nogueira, Yash Rajpal",
    "Description": "Join us for an exciting session where we will showcase the new botpress connector app for Rocket.Chat, an open-source chat platform that lets you create your own chatbots and integrations.",
    "Speaker": "Shubham Bhardwaj",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 3,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T11:40:00.000Z",
    "End": "2023-08-24T12:00:00.000Z",
    "Speaker": "Vinayak Sharma",
    "Title": "Whiteboard Integration",
    "Mentor": "Shiqi Mei, Douglas Gubert",
    "Description": "Do you want to enhance your team collaboration with whiteboards and visual drawing? If so, you will love our new Rocket.Chat App that integrates Markboard, an open-source whiteboard created by a Rocket.Chat GSoC alumni. Markboard is built on the same technology stack as Rocket.Chat, and it allows you to create and share concepts, diagrams, sketches, and more with your team members. In this session, you will learn how to install and use the app, how it extends Rocket.Chat’s team collaboration features, and what challenges and outcomes the project faced. You will also see some live demos of the app in action and interact with our project team. Don’t miss this opportunity to discover how Markboard can transform your team collaboration with Rocket.Chat!",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 4,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T12:00:00.000Z",
    "End": "2023-08-24T12:20:00.000Z",
    "Speaker": "Vivek Srivastava",
    "Title": "UiKit Playground 2.0",
    "Mentor": "Douglas Fabris, Guilherme Gazzo",
    "Description": "Are you interested in creating new UI elements for Rocket.Chat, the open-source chat platform? If so, you will enjoy our session on Rocket.Chat UiKit, the protocol/tool that allows Rocket.Chat apps to add new web and mobile elements to the current UI. Rocket.Chat UiKit is a powerful and flexible way to customize and extend your chat experience with Rocket.Chat. In this session, you will learn how to use the UiKit Playground, a tool that lets you visualize and test the main functionalities of the UiKit. You will also learn how to add other features that improve and encourage the development of apps, such as templates, workflows simulation, connecting to a workspace, and sending/sharing the prototypes through Rocket.Chat. You will also see some live demos of the UiKit in action and interact with our project team. Don’t miss this opportunity to discover how Rocket.Chat UiKit can help you create amazing UI elements for your chat apps!",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 5,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T12:20:00.000Z",
    "End": "2023-08-24T12:40:00.000Z",
    "Speaker": "",
    "Title": "20 minutes Break",
    "Mentor": "",
    "Description": "",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 6,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T12:40:00.000Z",
    "End": "2023-08-24T13:00:00.000Z",
    "Speaker": "Nabhag Motivaras",
    "Title": "Integrate Notion via RC App",
    "Mentor": "Samad Yar Khan, Bárbara Zanella",
    "Description": "In this presentation, you'll gain insights into the development of a unique integration that allows for seamless interaction between Rocket.Chat and Notion. Imagine the power of creating pages and receiving notifications, all without stepping out of Rocket.Chat's ecosystem.",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 7,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T13:00:00.000Z",
    "End": "2023-08-24T13:20:00.000Z",
    "Speaker": "Mohd Sameer",
    "Title": "Miro App for Rocket.Chat",
    "Mentor": "Mustafa Hasan Khan, Rafael Tapia",
    "Description": "Unleash your creativity as we explore the synergy between Rocket.Chat and Miro, opening doors to efficient idea sharing and visual collaboration. Don't miss out on this opportunity to witness firsthand how the Miro App transforms the way you work together. Join us and embark on a journey to boost productivity and engagement in your collaborative projects.",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 8,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T13:20:00.000Z",
    "End": "2023-08-24T13:40:00.000Z",
    "Speaker": "Aditya Singh",
    "Title": "Guided RC Code Walkthrough and Tutorial",
    "Mentor": "Kevin Aleman, Sing Li",
    "Description": "This project Project uses VS code's Code tour extension which helps us to create step by step tours Let's say if developer wants to know how a message is sent, they may install the extension and start the tour and the tour would traverse through multiple files and folders and guide users how things are happening.",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 9,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T13:40:00.000Z",
    "End": "2023-08-24T14:00:00.000Z",
    "Speaker": "Disha Bhardwaj",
    "Title": "Introduce Captcha to Livechat Widget",
    "Mentor": "Murtaza Patrawala, Renato Becker, Kevin Aleman",
    "Description": "Join us for a quick session unveiling the triumph against spam messages. Witness how RocketChat's live chat widget now stands fortified with CAPTCHA, ensuring human interactions and elevating user experience. Say goodbye to spam and hello to secure and seamless conversations. Be there to witness the evolution!",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 10,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T14:00:00.000Z",
    "End": "2023-08-24T14:20:00.000Z",
    "Speaker": "",
    "Title": "20 minutes Break",
    "Mentor": "",
    "Description": "",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 11,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T14:20:00.000Z",
    "End": "2023-08-24T14:40:00.000Z",
    "Speaker": "M. Palanikannan",
    "Title": "Google Summer of Code Community Hub",
    "Mentor": "Dhruv Jain, Devanshu, Hugo Costa",
    "Description": "Join us for an exciting session, presenting the Full-stack components, which can be leveraged to build a scalable, flexible GSoC Community Hub",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 12,
    "Event": "GSoC Demo Day",
    "Start": "2023-08-24T14:40:00.000Z",
    "End": "2023-08-24T14:45:00.000Z",
    "Speaker": "Rocketeers ",
    "Title": "Closing Notes",
    "Mentor": "",
    "Description": "",
    "Duration": 5,
    "Youtube": null
  },
  {
    "id": 13,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T06:00:00-04:00",
    "End": "2023-03-30T06:20:00-04:00",
    "Title": "Welcome to Rocket.Chat GSOC Alumni Summit 2023!",
    "Description": "Let's welcome all participants, contributors and Mentor!",
    "Speaker": "Gabriel Engel & Sing Li & Rodrigo Nascimento",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 14,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T06:20:00-04:00",
    "End": "2023-03-30T06:40:00-04:00",
    "Title": "Tips for creating a winning proposal!",
    "Description": "Ever wondered what's so special in an accepted proposal? Want to know what mentors look for in your proposal? Join in this fun conversation by a past GSoCer and a current GSoC mentor of two projects to know all you can do to make your proposal shine among others.",
    "Speaker": "Murtaza Patrawala",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 15,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T06:40:00-04:00",
    "End": "2023-03-30T07:00:00-04:00",
    "Title": "Opensource to Opportunities",
    "Description": "A talk that aims to explore how open source projects can provide opportunities for personal growth and professional development. The talk will highlight how contributing to open source projects can help participants build a portfolio of work, network with like-minded individuals, and develop technical skills. Attendees will learn about the different ways they can get involved in open source projects, and how doing so can lead to exciting opportunities in the tech industry. This talk is perfect for anyone interested in exploring the world of open source and discovering how it can help them advance their career goals.",
    "Speaker": "Sidharth Mohanty",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 16,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T07:00:00-04:00",
    "End": "2023-03-30T07:20:00-04:00",
    "Title": "Mentor expectation and mentee approach",
    "Description": "This talk covers the expectations mentors have from their mentees and how mentees can approach their mentors effectively to get the most out of their mentorship experience.",
    "Speaker": "Mustafa Hasan Khan",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 17,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T07:20:00-04:00",
    "End": "2023-03-30T07:50:00-04:00",
    "Title": "Break - Networking",
    "Description": "Time to chat with other participants and mentors",
    "Speaker": "Community",
    "Duration": 30,
    "Youtube": null
  },
  {
    "id": 18,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T07:50:00-04:00",
    "End": "2023-03-30T08:10:00-04:00",
    "Title": "Building a Rocket Chat App",
    "Description": "This talk will provide practical tips and advice for contributors interested in learning more about building RC Apps",
    "Speaker": "Samad Khan",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 19,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T08:10:00-04:00",
    "End": "2023-03-30T08:30:00-04:00",
    "Title": "Best practices for writing code/project documentation",
    "Description": "Writing clear and concise documentation is a key part of developing a successful project. This talk will cover best practices for writing effective code and project documentation, including tips for organizing and structuring documentation, using the appropriate tone and language, and providing examples and illustrations to help users understand the project. Additionally, we will discuss how documentation can help attract new contributors to the project and foster a culture of collaboration and transparency. Whether you are a seasoned developer or new to open source, this talk will provide valuable insights into how to create high-quality documentation that helps users understand and engage with your project",
    "Speaker": "Fongang Rodrique",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 20,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T08:30:00-04:00",
    "End": "2023-03-30T08:50:00-04:00",
    "Title": "Ways to give back to the open-source community and mentor future GSoC participants",
    "Description": "This talk will focus on different ways in which individuals can give back to the open-source community and support future participants of programs like Google Summer of Code (GSoC). The talk may cover topics such as contributing to open-source projects, organizing events and workshops to help new contributors, and becoming a mentor for GSoC or similar programs. The aim of this talk is to encourage attendees to actively contribute to the open-source community and help others get started with their own contributions.",
    "Speaker": "Devanshu Sharma",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 21,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T08:50:00-04:00",
    "End": "2023-03-30T09:10:00-04:00",
    "Title": "Practical approach to ace your GSoC safari with ease",
    "Description": "This talk will provide practical tips and advice for students who are participating in Google Summer of Code (GSoC), an annual program that offers stipends to university students to work on open source software projects. Attendees will learn about strategies for finding and selecting a project, communicating with mentors, writing strong project proposals, and successfully completing the program.",
    "Speaker": "Dhruv Jain",
    "Duration": 20,
    "Youtube": null
  },
  {
    "id": 22,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T09:10:00-04:00",
    "End": "2023-03-30T09:20:00-04:00",
    "Title": "Q&A",
    "Description": "Questions time, bring any questions you might have :)",
    "Speaker": "Community",
    "Duration": 10,
    "Youtube": null
  },
  {
    "id": 23,
    "Event": "GSoC Alumni Summit 2023",
    "Start": "2023-03-30T09:20:00-04:00",
    "End": "2023-03-30T09:30:00-04:00",
    "Title": "Final Notes",
    "Description": "Let's wrap up the summit!",
    "Speaker": "Community",
    "Duration": 10,
    "Youtube": null
  }
]
